:PROPERTIES:
:ID:       f02112b7-890c-4d98-81c9-41613e64aff7
:END:
#+TITLE: Guix on NixOS
#+CATEGORY: slips
#+TAGS:


*** Migrate the =/gnu/store= to a rootless =guix-daemon=

Without worrying about =guix gc=

These notes are wrong. There are a few dead ends I'd need to tunnel out of on
NixOS ... not that difficult, but also i'm not sure there are good answers to
these.

Also, for some reason =guix pull= is succeeding with the Nixos =services.guix=
installed. I'm pretty sure it's a trick though (since i'm running an old =guix=
from a profile still in =/gnu/store= that wasn't GC'd).

#+begin_quote
You'd probably want to do this all in one step. Otherwise, invalid state and
garbage processes could start piling up pretty quickly, leaving a borked system.
If you rebooted on NixOS, there's a chance you wouldn't be able to log into any
user, depending on how =~/.guix-profile= is set up in each bash profile.

I can still login to VTYs after removing =services.guix= from the nixos system.

I don't have too many guix profiles on my system ATM and the store content is
mostly derivative from other =/gnu/var/guix/profiles/per-user-dc= profiles that I
installed on top of the un-updatable guix binary from nix.
#+end_quote

When you remove the =services.guix.enable=, nix will remove:

+ The first =guix= that it installed from =/gnu/store=.
+ The =guix-build-user= users it created as well as the =guix-daemon= group & user

It leaves the =/gnu/var= directory in tact.

It's set up the =guix-daemon= to run rootfully, which means the store artifacts
are all tough & namespacey (very difficult to remove... formerly i guess).

+ [[https://guix.gnu.org/manual/devel/en/guix.html#Migrating-to-the-Unprivileged-Daemon][Migrate to the Unpriviliged Daemon]] describes how to move to the new rootless
  =guix-daemon= which relies on Linux user namespaces.
+ The =./nix-install.sh= script from DetSys should have an equivalent example for
  removing them.

There's a read-only bind-mount though

#+begin_src shell :results output verbatim
mount | grep guix | tr '()' '\n\n'
#+end_src

#+RESULTS:
: /dev/mapper/vgcrypt-root on /gnu type btrfs
: rw,noatime,compress=zstd:3,ssd,discard=async,space_cache=v2,subvolid=267,subvol=/@guix
:
: /dev/mapper/vgcrypt-root on /gnu/store type btrfs
: ro,noatime,compress=zstd:3,ssd,discard=async,space_cache=v2,subvolid=267,subvol=/@guix
:

As root

#+begin_src shell
groupadd --system guix-daemon
useradd -g guix-daemon -G guix-daemon,kvm               \
        -d /var/empty -s $(which nologin)               \
        -c "Guix daemon privilege separation user"      \
        --system guix-daemon

mount -o remount,rw /gnu/store

chown -R guix-daemon:guix-daemon                        \
  /gnu                                                  \
  /var/log/guix                                         \
  /etc/guix                                             \
  /gnu/var/guix/{gc.lock,daemon-socket,db,discover}     \
  /gnu/var/guix/{gcroots,offload,substitute,temproots}

# i needed to change these last two
# /var/guix/{gc.lock,daemon-socket,db,discover}
# /var/guix/{gcroots,offload,substitute,temproots}
#+end_src

At this point, the =./guix-install.sh= script should work.......... but i see that
it has hard-coded values for =/var= whereas I need it to install into =/gnu/var=.

+ I can't run =guix= right now because the socket file at
  =/gnu/var/guix/guix-daemon/socket= is dead
+ I also can't =guix shell -CPD= and finish the install
+ I could probably run the =guix-daemon= that I just built, but idk.

#+begin_src shell
# ... i.e. this does not work
wget https://guix.gnu.org/guix-install.sh
chmod +x guix-install.sh
export GUIX_BINARY_FILE_NAME=guix-binary.x86_64-linux.tar.xz
export GUIX_ALLOW_OVERWRITE=1
sudo --preserve-env=GUIX_BINARY_FILE_NAME ./guix-install.sh
#+end_src

So after:

+ Checking =find -name 'guix*.service' -exec grep var \{\} +=
+ Running through the script, it looks like it could install with either a
  symlink from =/var/guix -> /gnu/var/guix= ... or by =regexp-replace=. So I went
  with the latter

The next problem: =/etc/systemd/system= is in a read-only file-system.

#+begin_quote
This is fairly simple... i just don't feel like doing it. I at least feel like
I'm learning about what one might imagine they'd would learn about if they "did
things the hard way" ... which is actually nice.

seriously, it helped me learn a bit about systemd.
#+end_quote


*** Mime

Dump a list of unique attributes and tags for mimetypes (a little hacky)

#+begin_src shell
xq  '."mime-type" | objects | keys ' \
    $(echo -n $XDG_DATA_HOME $XDG_DATA_DIRS | tr ':' '\n' \
    | xargs -I\{\} find \{\}/mime -name '*.xml' 2>/dev/null) \
    | tr -d -C '[:alnum:]-@\n' | sort | uniq
#+end_src

#+RESULTS:
| acronym          |
| alias            |
| comment          |
| expanded-acronym |
| generic-icon     |
| glob             |
| sub-class-of     |
| @type            |
| @xmlns           |

dump a list of unique mimetypes

#+begin_src shell
echo -n $XDG_DATA_HOME $XDG_DATA_DIRS | tr ':' '\n' \
    | xargs -I\{\} find \{\}/mime -name '*.xml' 2>/dev/null \
    | sed -E 's/(.*)\/(.*)/\2    \1\2/g' \
    | sort | cut -f1 | uniq \
    | wc -l
#+end_src

#+RESULTS:
: 926

dump a table of mimetypes searched in order

#+begin_src shell
# probably should've used find the whole time, but xargs seems in order
echo -n $XDG_DATA_HOME $XDG_DATA_DIRS | tr ':' '\n' \
    | xargs -I\{\} find \{\}/mime -name '*.xml' 2>/dev/null \
    | sed -E 's/(.*)\/(.*)/\2    \1\2/g' # | sort
#+end_src

... there's not really anything on here

#+begin_src shell :results output verbatim
echo -n $XDG_DATA_DIRS | tr ':' '\n' \
    | xargs -I\{\} tree -d --noreport \{\}/mime 2>/dev/null \
    | grep -ve error
#+end_src

#+RESULTS:
#+begin_example
/gnu/store/mpbhcsairkigzv53dyj6k779dwy2w9d0-shared-mime-info-2.3/share/mime
├── application
├── audio
├── font
├── image
├── inode
├── message
├── model
├── multipart
├── packages
├── text
├── video
├── x-content
└── x-epoc
/home/dc/.guix-profile/share/mime
├── application
├── audio
├── font
├── image
├── inode
├── message
├── model
├── multipart
├── packages
├── text
├── video
├── x-content
└── x-epoc
/var/lib/flatpak/exports/share/mime
└── packages
/etc/profiles/per-user/dc/share/mime
├── application
└── packages
/run/current-system/sw/share/mime
├── application
├── audio
├── chemical
├── font
├── image
├── inode
├── message
├── model
├── multipart
├── packages
├── text
├── video
├── x-content
└── x-epoc
#+end_example
*** Data Dirs

#+begin_src shell
echo -n $XDG_DATA_HOME $XDG_DATA_DIRS | tr ':' '\n' \
    | xargs -I\{\} ls -1 \{\} 2>/dev/null | sort | uniq
#+end_src

#+RESULTS:
| aclocal             |
| appdata             |
| applications        |
| bash-completion     |
| dbus-1              |
| desktop-directories |
| devhelp             |
| doc                 |
| emacs               |
| fish                |
| gdb                 |
| gettext             |
| gir-1.0             |
| glib-2.0            |
| gnome-shell         |
| gtk-3.0             |
| gtk-doc             |
| guile               |
| guix                |
| hunspell            |
| icons               |
| info                |
| kservices5          |
| kservicetypes5      |
| kxmlgui5            |
| locale              |
| man                 |
| metainfo            |
| mime                |
| nano                |
| nvim                |
| org                 |
| pixmaps             |
| polkit-1            |
| sddm                |
| selinux             |
| sounds              |
| systemd             |
| terminfo            |
| themes              |
| thumbnailers        |
| uwsm                |
| vulkan              |
| wayland-sessions    |
| X11                 |
| xdg-desktop-portal  |
| xsessions           |
| zsh                 |

**** Comparing =dbus-daemon= and =dbus-broker=

Dependencies are fairly minimal, which I inferred after speccing out the above.
D-Bus can't have many dependencies, if it needs to handle those problems. I've
had D-Bus startup problems (the chopped and screwed desktop), but long-term
issues would be hard to notice. GNU =shepherd= seems to have sidestepped the need
for backwards compatibility and I guess now it makes a lot more sense.

#+begin_src shell :results output verbatim
echo -e "dbus-broker\n"
ldd `which dbus-broker` | tr -d "	" | sort

echo -e "\ndbus-daemon\n"
ldd `which dbus-daemon` | tr -d "	" | sort
#+end_src

#+RESULTS:
#+begin_example
dbus-broker

libcdvar-1.so.0 => /nix/store/370kymia4l5f8h9cpd2j65inn1rqb6yl-c-dvar-1.1.0/lib/libcdvar-1.so.0 (0x00007ff3bac81000)
libcrbtree-3.so.0 => /nix/store/ygawynjpi8bv5aby4ghg998b1gdibvsf-c-rbtree-3.2.0/lib/libcrbtree-3.so.0 (0x00007ff3bac7b000)
libc.so.6 => /nix/store/zdpby3l6azi78sl83cpad2qjpfj25aqx-glibc-2.40-66/lib/libc.so.6 (0x00007ff3ba800000)
libcutf8-1.so.0 => /nix/store/kpydsdwknvv3cfgzch97x2g48rdal4cb-c-utf8-1.1.0/lib/libcutf8-1.so.0 (0x00007ff3bab8b000)
libm.so.6 => /nix/store/zdpby3l6azi78sl83cpad2qjpfj25aqx-glibc-2.40-66/lib/libm.so.6 (0x00007ff3bab92000)
linux-vdso.so.1 (0x00007ff3bac91000)
/nix/store/zdpby3l6azi78sl83cpad2qjpfj25aqx-glibc-2.40-66/lib/ld-linux-x86-64.so.2 => /nix/store/zdpby3l6azi78sl83cpad2qjpfj25aqx-glibc-2.40-66/lib64/ld-linux-x86-64.so.2 (0x00007ff3bac93000)

dbus-daemon

libapparmor.so.1 => /nix/store/28dk0x39djdqlkcm0i1a2y3akpgyp8kk-libapparmor-4.1.1/lib/libapparmor.so.1 (0x00007fb0fb608000)
libcap.so.2 => /nix/store/q2ps6hq2jr2xwvs60m39fnjrnsx94a3w-libcap-2.75-lib/lib/libcap.so.2 (0x00007fb0fb5f9000)
libc.so.6 => /nix/store/zdpby3l6azi78sl83cpad2qjpfj25aqx-glibc-2.40-66/lib/libc.so.6 (0x00007fb0fb200000)
libdbus-1.so.3 => /nix/store/231d6mmkylzr80pf30dbywa9x9aryjgy-dbus-1.14.10-lib/lib/libdbus-1.so.3 (0x00007fb0fb7a1000)
libexpat.so.1 => /nix/store/l0d83xf43lsyhzqziy0am1cidhkcxs9q-expat-2.7.1/lib/libexpat.so.1 (0x00007fb0fb61f000)
libm.so.6 => /nix/store/zdpby3l6azi78sl83cpad2qjpfj25aqx-glibc-2.40-66/lib/libm.so.6 (0x00007fb0fb510000)
libpthread.so.0 => /nix/store/zdpby3l6azi78sl83cpad2qjpfj25aqx-glibc-2.40-66/lib/libpthread.so.0 (0x00007fb0fb50b000)
libsystemd.so.0 => /nix/store/n4kqvn450iwdyj83q80is8ija3lfi2iw-systemd-minimal-257.6/lib/libsystemd.so.0 (0x00007fb0fb64d000)
linux-vdso.so.1 (0x00007fb0fb802000)
/nix/store/zdpby3l6azi78sl83cpad2qjpfj25aqx-glibc-2.40-66/lib/ld-linux-x86-64.so.2 => /nix/store/zdpby3l6azi78sl83cpad2qjpfj25aqx-glibc-2.40-66/lib64/ld-linux-x86-64.so.2 (0x00007fb0fb804000)
#+end_example

